{
  "repositories": [
    {
      "title": "Awesome Earth Engine",
      "url": [
        "https://github.com/opengeos/Awesome-GEE",
        "https://awesome.geemap.org/"
      ],
      "description": "Curated list of Google Earth Engine resources, including tutorials, courses, and repositories, covering various aspects of coastal analysis and large-scale data processing.",
      "tags": [
        "GEE",
        "Algorithm",
        "Awesome_List",
        "Github_Repo"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "CoastSat",
      "url": [
        "https://github.com/kvos/CoastSat"
      ],
      "description": "Global shoreline mapping tool from satellite imagery, built on top of Google Earth Engine. Provides automated shoreline extraction capabilities using Landsat and Sentinel-2 imagery.",
      "tags": [
        "GEE",
        "Python",
        "Shoreline",
        "Coastal",
        "Satellite",
        "Mapping",
        "Tool"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "TAGEE",
      "url": [
        "https://github.com/zecojls/tagee"
      ],
      "description": "Terrain Analysis in Google Earth Engine (TAGEE). Useful for coastal slope and geomorphology analysis.",
      "tags": [
        "GEE",
        "JavaScript",
        "Terrain",
        "Analysis",
        "Tool",
        "Geomorphology",
        "Slope"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "geetools-code-editor",
      "url": [
        "https://github.com/fitoprincipe/geetools-code-editor"
      ],
      "description": "A set of tools for Google Earth Engine JavaScript Code Editor, including memory optimization and batch processing capabilities.",
      "tags": [
        "GEE",
        "JavaScript",
        "Tools",
        "Optimization",
        "Code_Editor"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Earth Engine Community",
      "url": [
        "https://github.com/google/earthengine-community"
      ],
      "description": "Official Google Earth Engine community tutorials and resources, including examples of coastal analysis and large-scale data processing.",
      "tags": [
        "GEE",
        "Tutorial",
        "Community",
        "Examples",
        "Official"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "ee-palettes",
      "url": [
        "https://github.com/gee-community/ee-palettes"
      ],
      "description": "A module for generating color palettes in Earth Engine for better data visualization, compatible with ES5.",
      "tags": [
        "GEE",
        "JavaScript",
        "Visualization",
        "Tool",
        "ES5"
      ],
      "dateAdded": "2025-02-04"
    }
  ],
  "papers": [
    {
      "title": "EXTRACTION OF COASTLINES WITH FUZZY APPROACH USING SENTINEL-1 SAR IMAGE",
      "url": "https://isprs-archives.copernicus.org/articles/XLI-B7/747/2016/",
      "doi": "https://isprs-archives.copernicus.org/articles/XLI-B7/747/2016/",
      "abstract": "Coastlines are important features for water resources, sea products, energy resources etc. Coastlines are changed dynamically, thus automated methods are necessary for analysing and detecting the changes along the coastlines. In this study, Sentinel-1 C band SAR image has been used to extract the coastline with fuzzy logic approach. The used SAR image has VH polarisation and 10x10m. spatial resolution, covers 57 sqkm area from the south-east of Puerto-Rico. Additionally, radiometric calibration is applied to reduce atmospheric and orbit error, and speckle filter is used to reduce the noise. Then the image is terrain-corrected using SRTM digital surface model. Classification of SAR image is a challenging task since SAR and optical sensors have very different properties. Even between different bands of the SAR sensors, the images look very different. So, the classification of SAR image is difficult with the traditional unsupervised methods. In this study, a fuzzy approach has been applied to distinguish the coastal pixels than the land surface pixels. The standard deviation and the mean, median values are calculated to use as parameters in fuzzy approach. The Mean-standard-deviation (MS) Large membership function is used because the large amounts of land and ocean pixels dominate the SAR image with large mean and standard deviation values. The pixel values are multiplied with 1000 to easify the calculations. The mean is calculated as 23 and the standard deviation is calculated as 12 for the whole image. The multiplier parameters are selected as a: 0.58, b: 0.05 to maximize the land surface membership. The result is evaluated using airborne LIDAR data, only for the areas where LIDAR dataset is available and secondly manually digitized coastline. The laser points which are below 0,5 m are classified as the ocean points. The 3D alpha-shapes algorithm is used to detect the coastline points from LIDAR data. Minimum distances are calculated between the LIDAR points of coastline with the extracted coastline. The statistics of the distances are calculated as following; the mean is 5.82m, standard deviation is 5.83m and the median value is 4.08 m. Secondly, the extracted coastline is also evaluated with manually created lines on SAR image. Both lines are converted to dense points with 1 m interval. Then the closest distances are calculated between the points from extracted coastline and manually created coastline. The mean is 5.23m, standard deviation is 4.52m. and the median value is 4.13m for the calculated distances. The evaluation values are within the accuracy of used SAR data for both quality assessment approaches.",
      "year": 2016,
      "tags": [
        "Approach",
        "Sentinel-1",
        "Coastlal",
        "Fuzzy",
        "Paper",
        "SAR",
        "LIDAR"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "CoastSat: A Google Earth Engine-enabled Python toolkit to extract shorelines from publicly available satellite imagery",
      "url": "https://doi.org/10.1016/j.envsoft.2019.104528",
      "doi": "10.1016/j.envsoft.2019.104528",
      "abstract": "This paper presents CoastSat, an open-source python toolkit enabling the extraction of shorelines from Landsat 5, Landsat 7, Landsat 8 and Sentinel-2 imagery. The toolkit combines image processing techniques, machine learning, and the power of cloud computing through Google Earth Engine to create a user-friendly Python package for shoreline mapping at any location worldwide. The fully automated shoreline extraction workflow includes sub-pixel resolution shoreline detection, automated tidally-induced shoreline correction, and robust outlier removal.",
      "year": 2019,
      "tags": [
        "GEE",
        "Python",
        "Shoreline",
        "Coastal",
        "Remote_Sensing",
        "Tool",
        "Paper"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Earth's surface water change over the past 30 years",
      "url": "https://doi.org/10.1038/nclimate3111",
      "doi": "10.1038/nclimate3111",
      "abstract": "Global-scale assessments of surface water dynamics using the Google Earth Engine platform, demonstrating methods for analyzing long-term changes in water bodies and coastlines.",
      "year": 2016,
      "tags": [
        "GEE",
        "Water",
        "Change_Detection",
        "Coastal",
        "Time_Series",
        "Global_Scale"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Google Earth Engine Cloud Computing Platform for Remote Sensing Big Data Applications: A Comprehensive Review",
      "url": "https://doi.org/10.1109/JSTARS.2020.3021052",
      "doi": "10.1109/JSTARS.2020.3021052",
      "abstract": "A comprehensive review of GEE capabilities, best practices, and optimization techniques for processing large-scale earth observation data.",
      "year": 2020,
      "tags": [
        "GEE",
        "Review",
        "Cloud_Computing",
        "Big_Data",
        "Optimization",
        "Best_Practices"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "High-resolution mapping of global surface water and its long-term changes",
      "url": "https://doi.org/10.1038/nature20584",
      "doi": "10.1038/nature20584",
      "abstract": "Study utilizing GEE for mapping surface water dynamics globally, including coastal areas and sea level impacts, with efficient processing of over 3 million Landsat scenes.",
      "year": 2016,
      "tags": [
        "GEE",
        "Water_Mapping",
        "Sea_Level",
        "Coastal",
        "Big_Data",
        "Landsat"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "ASSESSMENT OF COASTAL VULNERABILITY INDEX (CVI) AND ITS APPLICATION ALONG THE SRAGI COAST, SOUTH LAMPUNG, INDONESIA",
      "url": "https://geomatejournal.com/geomate/article/view/4233",
      "doi": "10.21660/2024.116.4233",
      "abstract": "One of the simplest and most widely used methods for evaluating coastal susceptibility to geomorphological and physical parameters is the Coastal susceptibility Index (CVI). This approach can thus be utilized as a resource for the local government to evaluate to measure vulnerability and determine the degree of risk that a coast faces. To execute successful risk reduction measures, this measurement is a fundamental first step. Thus, the purpose of this study is to evaluate the vulnerability of the coastal areas in Sragi, South Lampung, Indonesia, using the Coastal Vulnerability Index (CVI) approach, which calculates physical and geomorphological parameters. The six factors that make up the assessment of coastal vulnerability are as follows: tidal range, significant wave height, coastal elevation, sea-level change rate, shoreline change rate, and geomorphology. The 6 km long Sragi coastal areas are split into 12 sections. With a covering area of 500 meters, each segment accurately reflects the size of the region under assessment. The result shows that the total of 83.33% of the Sragi coastal area is classified as having a very high vulnerability index, influenced by the values of shoreline change predominantly experiencing a change of < -2.0 m/year along a 5 km stretch of the coastline and the number of coastal slopes. This condition indicates that along the 5 km coastline of Sragi, there is a more predominant occurrence of erosion or shoreline retreat.",
      "year": 2024,
      "tags": [
        "Vulnerability_Assessment",
        "Coastal_Area",
        "CVI",
        "Indonesia",
        "Coastal_Zone",
        "Geomorphology",
        "Erosion"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Global temperature change attributable to humans prior to and after the 2015 Paris Agreement",
      "url": "https://www.nature.com/articles/s41558-022-01281-0",
      "doi": "10.1038/s41558-022-01281-0",
      "year": 2022,
      "tags": [
        "Climate_Change",
        "Paris_Agreement",
        "Temperature",
        "Global_Warming",
        "Human_Impact"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Long-Term Shoreline Change along the Eastern Coast of Peninsular Malaysia Using Satellite Images",
      "url": "https://www.mdpi.com/2077-1312/10/11/1602",
      "doi": "10.3390/jmse10111602",
      "year": 2022,
      "abstract": "Coastal areas are highly dynamic and vulnerable to various natural and anthropogenic factors. The eastern coast of Peninsular Malaysia has experienced significant changes in shoreline position due to monsoon seasons and human activities. This study aimed to analyze the long-term shoreline changes along the eastern coast of Peninsular Malaysia using multi-temporal satellite images from 1988 to 2020.",
      "tags": [
        "Shoreline_Change",
        "Remote_Sensing",
        "Coastal_Dynamics",
        "Malaysia",
        "Satellite_Imagery",
        "Coastal_Management"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Cliff erosion patterns and rates along the California coast from repeat aerial photogrammetry and airborne lidar",
      "url": "https://esurf.copernicus.org/articles/12/1049/2024/",
      "doi": "10.5194/esurf-12-1049-2024",
      "year": 2024,
      "abstract": "Coastal cliff erosion threatens infrastructure and public safety along the California coast, yet the patterns and drivers of cliff erosion over large spatial scales remain poorly understood. We analyze coastal cliff erosion along ∼ 300 km of the California coast between 2009–2011 and 2016 using repeat aerial photogrammetry and lidar.",
      "tags": [
        "Cliff_Erosion",
        "California_Coast",
        "LiDAR",
        "Coastal_Monitoring",
        "Photogrammetry",
        "Coastal_Hazards"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Mapping Coastal Change in Alaska Using Deep Learning on Historical Aerial Photos",
      "url": "https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF005013",
      "doi": "10.1029/2024EF005013",
      "year": 2024,
      "tags": [
        "Deep_Learning",
        "Coastal_Change",
        "Alaska",
        "Aerial_Photography",
        "Historical_Data",
        "Machine_Learning"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Arctic Data Center: A Repository for Arctic Research Data",
      "url": "https://arcticdata.io/catalog",
      "tags": [
        "Arctic",
        "Data_Repository",
        "Climate_Data",
        "Research_Data",
        "Environmental_Data"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "21st Century Sea-Level Rise Could Exceed IPCC Projections for Strong-Warming Futures",
      "url": "https://www.pnas.org/doi/10.1073/pnas.2409411121",
      "doi": "10.1073/pnas.2409411121",
      "year": 2024,
      "tags": [
        "Sea_Level_Rise",
        "Climate_Change",
        "IPCC",
        "Projections",
        "Climate_Models",
        "Future_Scenarios"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Comprehensive Assessment of Coastal Vulnerability Using Remote Sensing and GIS Techniques",
      "url": "https://www.osti.gov/servlets/purl/1670531/",
      "tags": [
        "Coastal_Vulnerability",
        "Remote_Sensing",
        "GIS",
        "Assessment",
        "Coastal_Management"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Using Machine Learning to Predict Coastal Erosion from Satellite Images",
      "url": "https://ui.adsabs.harvard.edu/abs/2023AGUFM.C33C1416X/abstract",
      "year": 2023,
      "tags": [
        "Machine_Learning",
        "Coastal_Erosion",
        "Satellite_Imagery",
        "Prediction",
        "Remote_Sensing"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Global ice loss driven by climate change accelerating across continents",
      "url": "https://www.sciencedirect.com/science/article/pii/S0048969724005242",
      "doi": "10.1016/j.scitotenv.2024.168747",
      "year": 2024,
      "tags": [
        "Climate_Change",
        "Ice_Loss",
        "Global_Change",
        "Environmental_Science",
        "Remote_Sensing"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Extreme Arctic rain events trigger widespread winter warming",
      "url": "https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2024GL108622",
      "doi": "10.1029/2024GL108622",
      "year": 2024,
      "tags": [
        "Arctic",
        "Climate_Change",
        "Precipitation",
        "Winter_Warming",
        "Extreme_Events"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Machine learning accelerates detection of coral reef change",
      "url": "https://www.nature.com/articles/s41558-024-02074-3",
      "doi": "10.1038/s41558-024-02074-3",
      "year": 2024,
      "tags": [
        "Machine_Learning",
        "Coral_Reefs",
        "Climate_Change",
        "Marine_Ecosystems",
        "Environmental_Monitoring"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Semi-automated feature extraction in Canadian Arctic coastal imagery",
      "url": "https://www.tandfonline.com/doi/full/10.1080/07038992.2017.1370367",
      "doi": "10.1080/07038992.2017.1370367",
      "year": 2017,
      "tags": [
        "Arctic",
        "Coastal",
        "Remote_Sensing",
        "Feature_Extraction",
        "Image_Processing",
        "Canada"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Defining the arctic coastline with satellite data",
      "url": "https://repositum.tuwien.at/bitstream/20.500.12708/17415/1/Efimova%20Aleksandra%20-%202021%20-%20Defining%20the%20arctic%20coastline%20with%20satellite%20data.pdf",
      "year": 2021,
      "tags": [
        "Arctic",
        "Coastline",
        "Satellite_Data",
        "Remote_Sensing",
        "Methodology",
        "Thesis"
      ],
      "dateAdded": "2025-02-04"
    }
  ],
  "websites": [
    {
      "title": "Global Surface Water Explorer",
      "url": "http://global-surface-water.appspot.com/",
      "description": "Interactive platform for exploring global surface water changes, useful for coastal water analysis and sea level monitoring.",
      "tags": [
        "GEE",
        "Water",
        "Visualization",
        "Analysis",
        "Tool",
        "Web_App"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Climate Engine",
      "url": "https://clim-engine.appspot.com/climateEngine",
      "description": "Web application for climate analysis including sea surface temperature and climate variables relevant to coastal studies.",
      "tags": [
        "GEE",
        "Climate",
        "Analysis",
        "Temperature",
        "Web_App"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "CoastSat Shoreline Change Database",
      "url": "http://coastsat.wrl.unsw.edu.au/",
      "description": "Database of shoreline changes derived from satellite imagery using the CoastSat toolkit.",
      "tags": [
        "GEE",
        "Shoreline",
        "Database",
        "Change_Detection",
        "Web_App"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "USGS Great Lakes and Coastal Ecosystems Science",
      "url": "https://apps.usgs.gov/glbeco/gce.html",
      "description": "USGS resource for Great Lakes and coastal ecosystems research and data.",
      "tags": [
        "USGS",
        "Great_Lakes",
        "Coastal",
        "Ecosystems",
        "Research",
        "Data_Portal"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "WorldPop",
      "url": "https://www.worldpop.org/",
      "description": "Global population distribution data and demographic statistics.",
      "tags": [
        "Population_Data",
        "Demographics",
        "Global_Data",
        "Spatial_Data",
        "Open_Data"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Arctic SDI Geoportal",
      "url": "https://geoportal.arctic-sdi.org/",
      "description": "Spatial data infrastructure for Arctic region mapping and monitoring.",
      "tags": [
        "Arctic",
        "GIS",
        "Spatial_Data",
        "Mapping",
        "Geoportal",
        "SDI"
      ],
      "dateAdded": "2025-02-04"
    }
  ],
  "courses": [
    {
      "title": "End-to-End Google Earth Engine",
      "url": "https://courses.spatialthoughts.com/end-to-end-gee.html",
      "description": "Comprehensive course covering GEE fundamentals, memory management, and optimization techniques by Ujaval Gandhi.",
      "author": "Ujaval Gandhi",
      "tags": [
        "GEE",
        "Course",
        "Tutorial",
        "Optimization",
        "Best_Practices",
        "Free"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Spatial Data Management with Earth Engine",
      "url": "https://www.youtube.com/playlist?list=PLAxJ4-o7ZoPdz9LHIJIxHlZe3t-MRCn61",
      "description": "Video course focusing on efficient data management and processing in GEE by Qiusheng Wu.",
      "author": "Qiusheng Wu",
      "tags": [
        "GEE",
        "Course",
        "Video",
        "Data_Management",
        "Performance",
        "Free"
      ],
      "dateAdded": "2025-02-04"
    }
  ],
  "books": [
    {
      "title": "Cloud-Based Remote Sensing with Google Earth Engine",
      "url": "https://www.eefabook.org/",
      "description": "Comprehensive guide covering GEE fundamentals, best practices, and optimization techniques for large-scale geospatial analysis.",
      "tags": [
        "GEE",
        "Book",
        "Remote_Sensing",
        "Cloud_Computing",
        "Best_Practices"
      ],
      "dateAdded": "2025-02-04"
    }
  ],
  "datasets": [
    {
      "title": "Sentinel-1 SAR GRD",
      "url": "https://developers.google.com/earth-engine/datasets/catalog/COPERNICUS_S1_GRD",
      "description": "Sentinel-1 SAR Ground Range Detected (GRD) scenes, processed using the Sentinel-1 Toolbox, useful for coastal monitoring and wave analysis.",
      "tags": [
        "GEE",
        "Dataset",
        "Sentinel-1",
        "SAR",
        "Coastal",
        "Wave"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Sentinel-2 MSI Surface Reflectance",
      "url": "https://developers.google.com/earth-engine/datasets/catalog/COPERNICUS_S2_SR_HARMONIZED",
      "description": "Harmonized Sentinel-2 MSI Surface Reflectance data, ideal for shoreline detection and coastal vegetation analysis.",
      "tags": [
        "GEE",
        "Dataset",
        "Sentinel-2",
        "Optical",
        "Surface_Reflectance",
        "Coastal"
      ],
      "dateAdded": "2025-02-04"
    },
    {
      "title": "Arctic Coastal Dynamics Database",
      "url": "https://arcticdata.io/catalog/view/doi:10.18739%2FA21J97929",
      "description": "Comprehensive dataset of Arctic coastal dynamics and changes.",
      "tags": [
        "Arctic",
        "Coastal",
        "Database",
        "Environmental_Data",
        "Time_Series"
      ],
      "dateAdded": "2025-02-04"
    }
  ],
  "presentations": [
    {
      "title": "Cloud computing and interactive mapping with Earth Engine and open-source GIS",
      "url": "https://www.researchgate.net/publication/341722639_Cloud_computing_and_interactive_mapping_with_Earth_Engine_and_open-source_GIS",
      "description": "Technical presentation focusing on efficient cloud computing strategies and memory optimization in GEE.",
      "author": "Qiusheng Wu",
      "date": "2020-05-28",
      "tags": [
        "GEE",
        "Presentation",
        "Cloud_Computing",
        "Performance",
        "Best_Practices"
      ],
      "dateAdded": "2025-02-04"
    }
  ],
  "metadata": {
    "lastUpdated": "2025-02-04T22:58:41+01:00",
    "counts": {
      "repositories": 6,
      "papers": 19,
      "websites": 6,
      "courses": 2,
      "books": 1,
      "datasets": 3,
      "presentations": 1
    }
  }
}